# Assignment -3 Multiple variable Linear Regression ,Submitted by:Ramen Kumar Das(ML-B-003)

In [1]:
import pandas as pd
import numpy as np
import seaborn as seaborn

In [2]:
df=pd.read_csv('agora.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [5]:
df.Transport.mean()

215331.73244897963

In [6]:
fill=df.Transport.mean()
df.Transport=df.Transport.fillna(fill) # null value replace by Transport column mean value

In [7]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# One hot Encoding used for categorical column Area

In [8]:
dummy=pd.get_dummies(df.Area,drop_first=True)
dummy.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [9]:
df=df.drop('Area',axis=1)
df=pd.concat([df,dummy],axis=1)
df.head()

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.51       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

In [10]:
x=df.drop(['Profit'],axis=1)
y=df['Profit']

In [11]:
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [12]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Feature scaling using standardization

In [13]:
from sklearn.preprocessing import StandardScaler

In [14]:
std= StandardScaler()
newx=std.fit_transform(x)

In [15]:
dfx=pd.DataFrame(newx,columns=x.columns)
dfx.head()

   Marketing Spend  Administration  Transport     Dhaka   Rangpur
0         0.897913        0.560753   2.187271  1.393261 -0.685994
1         1.955860        1.082807   1.949436 -0.717741 -0.685994
2         1.754364       -0.728257   1.642701 -0.717741  1.457738
3         1.554784       -0.096365   1.431738  1.393261 -0.685994
4         1.504937       -1.079919   1.286479 -0.717741  1.457738

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
xtrain,xtest,ytrain,ytest=train_test_split(dfx,y,test_size=.30,random_state=12)

In [18]:
from sklearn.linear_model import LinearRegression
reg=LinearRegression()

In [19]:
reg.fit(xtrain,ytrain)

LinearRegression()

In [20]:
import matplotlib.pyplot as plt
plt.plot()

In [21]:
pred=reg.predict(xtest)
from sklearn.metrics import mean_squared_error
mean_squared_error(ytest,pred)

371800098.0225704

# R-squared value

In [23]:
from sklearn.metrics import r2_score

In [24]:
score=r2_score(ytest,pred)

In [25]:
score

0.6452606588688964